src/InformationRegisters/СтатусыВерсийХранилищаСлужебный/СтатусыВерсийХранилищаСлужебный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыВерсийХранилищаСлужебный</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИсторииХранилищ</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Процесс</name>
    <type>
      <types>BusinessProcessRef.ПредварительнаяПроверка</types>
      <types>BusinessProcessRef.СогласованиеПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусыВерсийХранилища/СтатусыВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыВерсийХранилища</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИсторииХранилищ</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Процесс</name>
    <type>
      <types>BusinessProcessRef.ПредварительнаяПроверка</types>
      <types>BusinessProcessRef.СогласованиеПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиУниверсальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусыВерсийХранилищаСлужебный/ManagerModule.bsl
Процедура Перезаполнить() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыВерсийХранилища.ВерсияХранилища КАК ВерсияХранилища,
		|	МАКСИМУМ(СтатусыВерсийХранилища.Период) КАК Период,
		|	МАКСИМУМ(СтатусыВерсийХранилища.ДатаЗаписиУниверсальная) КАК ДатаЗаписиУниверсальная
		|ПОМЕСТИТЬ МаксимальныйПериод
		|ИЗ
		|	РегистрСведений.СтатусыВерсийХранилища КАК СтатусыВерсийХранилища
		|
		|СГРУППИРОВАТЬ ПО
		|	СтатусыВерсийХранилища.ВерсияХранилища
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатусыВерсийХранилища.Период КАК Период,
		|	СтатусыВерсийХранилища.ДатаЗаписиУниверсальная КАК ДатаЗаписиУниверсальная,
		|	СтатусыВерсийХранилища.ВерсияХранилища КАК ВерсияХранилища,
		|	СтатусыВерсийХранилища.Статус КАК Статус,
		|	СтатусыВерсийХранилища.Ответственный КАК Ответственный,
		|	СтатусыВерсийХранилища.Процесс КАК Процесс,
		|	СтатусыВерсийХранилища.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.СтатусыВерсийХранилища КАК СтатусыВерсийХранилища
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйПериод КАК МаксимальныйПериод
		|		ПО СтатусыВерсийХранилища.ВерсияХранилища = МаксимальныйПериод.ВерсияХранилища
		|			И СтатусыВерсийХранилища.Период = МаксимальныйПериод.Период
		|			И СтатусыВерсийХранилища.ДатаЗаписиУниверсальная = МаксимальныйПериод.ДатаЗаписиУниверсальная
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВерсияХранилища,
		|	ДатаЗаписиУниверсальная";
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из ТЗ Цикл
		Стр.Период = '00010101' + Стр.ДатаЗаписиУниверсальная / 1000;
	КонецЦикла;
	Набор = РегистрыСведений.СтатусыВерсийХранилищаСлужебный.СоздатьНаборЗаписей();
	Набор.Загрузить(ТЗ);
	Набор.Записать();
КонецПроцедуры
